---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelSketchAlignmentMethod
source: html/5fa70a23-78ea-f7cf-1706-cbf30edee988.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelSketchAlignmentMethod Property

"Alignment Method"

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelSketchAlignmentMethod { get; }
```